In [1]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [2]:
data['b']

np.float64(0.5)

In [3]:
'a' in data

True

In [4]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [7]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [8]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [9]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [10]:
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [11]:
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [12]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [13]:
# explicit index when indexing
data[1]

'a'

In [14]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [17]:
# loc allow indexing and slicing with explicit index
data.loc[1]

'a'

In [18]:
data.loc[1:3]

1    a
3    b
dtype: object

In [21]:
# iloc allow indexing and slicing with implicit index
data.iloc[1]

'b'

In [22]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [24]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'Florida': 170312, 'New York': 141297,
                  'Pennysylvania': 119280})
pop = pd.Series({'California': 39538223, 'Texas': 29145505,
                 'Florida': 21538187, 'New York': 20201249,
                 'Pennysylvania': 13002700})
data = pd.DataFrame({'area':area, 'pop':pop})
data

                 area       pop
California     423967  39538223
Texas          695662  29145505
Florida        170312  21538187
New York       141297  20201249
Pennysylvania  119280  13002700

In [25]:
data['area']

California       423967
Texas            695662
Florida          170312
New York         141297
Pennysylvania    119280
Name: area, dtype: int64

In [26]:
data.area

California       423967
Texas            695662
Florida          170312
New York         141297
Pennysylvania    119280
Name: area, dtype: int64

In [27]:
data.pop is data['pop']

False

In [28]:
data['density'] = data['pop'] / data['area']
data

                 area       pop     density
California     423967  39538223   93.257784
Texas          695662  29145505   41.896072
Florida        170312  21538187  126.463121
New York       141297  20201249  142.970120
Pennysylvania  119280  13002700  109.009893

In [29]:
data.values

array([[4.23967000e+05, 3.95382230e+07, 9.32577842e+01],
       [6.95662000e+05, 2.91455050e+07, 4.18960717e+01],
       [1.70312000e+05, 2.15381870e+07, 1.26463121e+02],
       [1.41297000e+05, 2.02012490e+07, 1.42970120e+02],
       [1.19280000e+05, 1.30027000e+07, 1.09009893e+02]])

In [30]:
data.T

           California         Texas       Florida      New York  Pennysylvania
area     4.239670e+05  6.956620e+05  1.703120e+05  1.412970e+05   1.192800e+05
pop      3.953822e+07  2.914550e+07  2.153819e+07  2.020125e+07   1.300270e+07
density  9.325778e+01  4.189607e+01  1.264631e+02  1.429701e+02   1.090099e+02

In [31]:
data

                 area       pop     density
California     423967  39538223   93.257784
Texas          695662  29145505   41.896072
Florida        170312  21538187  126.463121
New York       141297  20201249  142.970120
Pennysylvania  119280  13002700  109.009893

In [32]:
data.values[0]

array([4.23967000e+05, 3.95382230e+07, 9.32577842e+01])

In [33]:
data['area']

California       423967
Texas            695662
Florida          170312
New York         141297
Pennysylvania    119280
Name: area, dtype: int64

In [34]:
data.iloc[:3, :2]

              area       pop
California  423967  39538223
Texas       695662  29145505
Florida     170312  21538187

In [37]:
data.loc[:'Florida', :'pop']

              area       pop
California  423967  39538223
Texas       695662  29145505
Florida     170312  21538187

In [38]:
data.loc[data.density > 120, ['pop', 'density']]

               pop     density
Florida   21538187  126.463121
New York  20201249  142.970120

In [39]:
data.iloc[0, 2] = 90
data

                 area       pop     density
California     423967  39538223   90.000000
Texas          695662  29145505   41.896072
Florida        170312  21538187  126.463121
New York       141297  20201249  142.970120
Pennysylvania  119280  13002700  109.009893

In [40]:
data['Florida':'New York']

            area       pop     density
Florida   170312  21538187  126.463121
New York  141297  20201249  142.970120

In [41]:
data[1:3]

           area       pop     density
Texas    695662  29145505   41.896072
Florida  170312  21538187  126.463121

In [42]:
data[data.density > 120]

            area       pop     density
Florida   170312  21538187  126.463121
New York  141297  20201249  142.970120